#include <boost/di.hpp>
#include <iostream>
#include <memory>

#include "MenuSystem.h"
#include "VetClinic.h"
#include "Zoo.h"

////////////////////////////////////////////////////////////////////////////////

namespace di = boost::di;

////////////////////////////////////////////////////////////////////////////////

int main() {

  setlocale(LC_ALL, "");

  //--------------------------------------------------------------------------//

  auto injector = di::make_injector(di::bind<IVetClinic>.to<VetClinic>());

  //--------------------------------------------------------------------------//

  auto zoo = injector.create<std::shared_ptr<Zoo>>();

  //--------------------------------------------------------------------------//

  MenuContext menu(zoo);

  //--------------------------------------------------------------------------//

  menu.Run();

  //--------------------------------------------------------------------------//

  std::cout << "Программа завершена.\n";
  return 0;
}
